{
  "stop": "Stop",
  "run": "Run",
  "ask_for_help": "Ask for Help",
  "question_wizard": "Question Wizard",
  "previous": "Previous",
  "next": "Next",
  "table_of_contents": "Table of Contents",
  "skip_step": "Skip step",
  "reverse_step": "Reverse step",
  "sign_out": "Sign out",
  "settings": "Settings",
  "feedback": "Feedback",
  "developer_mode": "Developer mode",
  "developer_mode_description": "Enables the \"Reverse step\" and \"Skip step\" buttons.",
  "loading_wait": "Loading...",
  "login_or_sign_up": "Login / Sign up",
  "error_traceback":"Error traceback:",
  "did_you_mean": "Did you mean...",
  "similar_frames_skipped": "Similar frames skipped:",
  "report_error": "Report error",
  "report_error_instructions": "Oops, something went wrong! Please describe what you were just doing and what steps someone can take to reproduce the problem, then click Submit. Or click Cancel to not send a report.",
  "click_for_error_details": "Click for error details",
  "give_feedback": "Give feedback",
  "feedback_email_placeholder": "Email (optional)",
  "title": "Title",
  "description": "Description",
  "submit": "Submit",
  "cancel": "Cancel",
  "contact_directly": "Alternatively, you can contact us directly:",
  "send_email_to": "Email",
  "open_github_issue": "Open an issue on GitHub",
  "chat_on_slack": "Chat on Slack",
  "copying_solution_not_allowed": "Copying from the hints/solution area is not allowed!",
  "get_hint": "Get a hint",
  "get_another_hint": "Get another hint",
  "show_solution": "Show solution",
  "show_unscrambled_solution": "Show unscrambled solution",
  "show_shuffled_solution": "Show shuffled solution",
  "parsons_solution_instructions": "Above is an example solution with the lines out of order. You can drag them around to reorder them. Finding a correct order is up to you, and we won't will tell you if you get it right. Experimenting and running partial solutions in the editor may help you figure it out. You still need to type a correct solution into the editor and run it to continue.",
  "are_you_sure": "Are you sure?",
  "yes": "Yes",
  "no": "No",
  "hidden_solution_instructions": "Above is an example solution, but it's hidden. Click the Reveal button repeatedly to reveal the solution bit by bit. Try to stop when you think you've revealed enough and can fill in the remaining gaps yourself. Then type a solution in the editor and run it. Your solution doesn't have to be the same as the one above.",
  "reveal": "Reveal",
  "output_prediction_question": "What do you think the result will be?",
  "output_prediction_wrong_once": "Oops, that's not right. You can try one more time!",
  "output_prediction_wrong_twice": "Sorry, wrong answer. Try again next time!",
  "output_prediction_correct": "Correct!",
  "output_prediction_error_choice": "Error",
  "ok": "OK",
  "current_page": "(current)",
  "question_wizard_intro": "If you need help, there are many sites like [Stack Overflow](https://stackoverflow.com/) and [reddit](https://www.reddit.com/r/learnpython/) where you can ask questions. This is a tool to help you write a good quality question that is likely to get answers.\n\nEnter and run your code on the right. If you don't have any code because you don't know where to get started, I'm afraid this tool can't help you. You can still ask for help, but it might be good to first read [What types of questions should I avoid asking?](https://stackoverflow.com/help/dont-ask)\n\nIf your question is about servers (e.g. Django or Flask), web requests, databases, or a package that can't be imported here, then this tool won't work. However, just because your current code *involves* those things, that doesn't mean that's what your question is *about*. If you're having a general Python/programming/logic problem, then extract that problem from the other stuff. Python with Django is still Python. If you can't do that, then read [How to create a Minimal, Reproducible Example](https://stackoverflow.com/help/minimal-reproducible-example) before asking your question.",
  "question_wizard_expected_output": "Good, now enter the output you expect/want from your program below. What would it show if it worked correctly? If it's not supposed to output anything, then add some `print()` calls to your code so that it would output something useful.\n\nWhen you're done, click 'Run' again to generate your question.",
  "give_feedback_instructions": "Tell us what you like or don't like! If you're reporting a bug, give a detailed description of the problem:\n\n- What were you doing before and when the problem occurred?\n- What steps can someone take to reproduce it?\n- What do you observe happening, and what do you expect to happen instead?",
  "toc_instructions": "Below are links to different pages in the course. You can start anywhere and go in any order, and your progress on each page will be recorded.\n\nIf you're completely new to programming, or you have doubts, just start at the beginning and click Next as you finish each page.",
  "hints_progress": "Shown ${numHints} of ${totalHints} hints",
  "repeated_frames_description": "${name} at line ${lineno} (${count} times)",
  "click_to_expand": "Click to expand",
  "requirements": "Requirements",
  "requirements_description": "You need to run some code according to the instructions above. In case those aren't clear enough, here's some extra clarification:",
  "exercise_requirement": "This step is an exercise. You need to figure out what code will produce the correct result. Many different correct answers are possible.",
  "no_input_variables": "This exercise has no input variables.",
  "non_function_exercise": "Your code *must* start by assigning value(s) to input variable(s), e.g:\n\n${inputs}\n\nThe values are just examples, you can choose different ones. Your code will be tested automatically with different values to check that it works generally.",
  "function_exercise": "Define a function starting like this:\n\n${header}\n\nThen fill in the indented body with your implementation.\n\nThe function will be called with different arguments to test that it works generally. You can also call the function yourself to test it as you work, but it doesn't affect the testing.",
  "function_exercise_goal": "Your function needs to `${print_or_return}` the correct result.",
  "function_exercise_stdin": "Your program needs to receive input from the user via the `input()` function. When it's tested for correctness, different user inputs will be simulated.",
  "verbatim": "This step has only one correct answer. You must run exactly the correct code, so check your spelling carefully. Only a few kinds of details (such as spaces in certain places) will be ignored, as they don't make any difference to the program.",
  "program_in_text": "The exact code that you need to run is shown in the text above, in one piece.",
  "copy_warning": "**STOP!**\n\nTry to avoid copy pasting code. You will learn, absorb, and remember better if you type in the code yourself.\n\nWhen copying is appropriate, there will be a button to click to make it easy. If there's no button, try typing.\n\nHaving said that, we're not going to force you. Copy if you really want to."
}
